src/toir_cfe/src/Documents/проф_СписаниеТМЦНеТребуется/проф_СписаниеТМЦНеТребуется.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ca4e2695-9435-4dc8-bc67-1e1b083768a6">
  <name>проф_СписаниеТМЦНеТребуется</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="9d832bb0-64b9-49b8-b5dd-465b88c7685a">
    <name>АктОВыполненииЭтапаРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3adb3e12-f1c0-44a0-9e2d-3d7cc811d060">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="729eb4a4-ca85-43aa-be62-5d2115baea8a">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0b3df086-16ce-4fc2-8914-c13393e2afa0">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="810fda09-bdf9-4eb2-93e2-0828822e19e5">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0ff0dc43-64c3-4d91-8f22-e53abc933783">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Documents/проф_СписаниеТМЦНеТребуется/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область Проведение

//++ Проф-ИТ, #329, Соловьев А.А., 07.11.2023

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапроса(Запрос, ТекстыЗапроса, Регистры);
	
	ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
КонецПроцедуры

Функция ТекстЗапроса(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт";
	
	Если НЕ ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	проф_СписаниеТМЦНеТребуется.АктОВыполненииЭтапаРабот КАК АктОВыполненииЭтапаРабот,
	|	проф_СписаниеТМЦНеТребуется.Дата КАК Период,
	|	проф_СписаниеТМЦНеТребуетсяТовары.Номенклатура КАК Номенклатура,
	|	проф_СписаниеТМЦНеТребуетсяТовары.Характеристика КАК Характеристика,
	|	проф_СписаниеТМЦНеТребуетсяТовары.Количество КАК Количество
	|ИЗ
	|	Документ.проф_СписаниеТМЦНеТребуется.Товары КАК проф_СписаниеТМЦНеТребуетсяТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.проф_СписаниеТМЦНеТребуется КАК проф_СписаниеТМЦНеТребуется
	|		ПО проф_СписаниеТМЦНеТребуетсяТовары.Ссылка = проф_СписаниеТМЦНеТребуется.Ссылка
	|ГДЕ
	|	проф_СписаниеТМЦНеТребуется.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры)

	Если ЗначениеЗаполнено(Регистры) Тогда
		
		Если ТипЗнч(Регистры) = Тип("Строка") Тогда
			МассивРегистров = Новый Структура(Регистры);
		Иначе
			МассивРегистров = Регистры;
		КонецЕсли;
		
		Если НЕ МассивРегистров.Свойство(ИмяРегистра) Тогда
			Возврат Ложь;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат Истина;

КонецФункции

//-- Проф-ИТ, #329, Соловьев А.А., 07.11.2023

#КонецОбласти

#КонецОбласти

#КонецЕсли
